#-*- coding: utf-8 -*-
#@time    : 2019/3/14 13:42
#@author  : lenmon_shan
#@Email   :1529755032@qq.com
#@file    : test_05.py

#本次阶段6--0327

#学习正则表达式 learm_regex,
#添加do_regex模块
#修改add_loan单元测试，测试用例使用正则表达式，在excel表中进行正则表达试
#修改login单元测试，测试用例使用正则表达式，在excel表中进行正则表达试
#修改invest单元测试，测试用例使用正则表达式，在excel表中进行正则表达试
#修改recharge单元测试，测试用例使用正则表达式，在excel表中进行正则表达试

# 作业已完成:
# 1，将Excel中的手机号码，memberid 进行参数化设置，同步在配置文件中或者GetData中增加相关配置或者属性。（注意KEY保持一致）
#
# 2，编写正则表达式，匹配查找参数化的KEY，提取出来
#
# 3，根据提取出来的KEY，获取配置文件的值或者GetData相关的属性值
#
# 4，将获取的配置值或者属性值替换到原来的参数化的地方

# 持续集成的安装和git的安装和配置


# 3.29--git的代码拉取和jenkins自动化测试任务自动构建的使用

















